// © Copyright 2012-2015 HP Development Company, L.P.

TaskName = "Laitehaku";


// Search Task
SearchTaskName = "Valitse laite";
SearchTaskTitle = "Valitse määritettävä laite";

AllFilterTitle = "Kaikki";

DevicesFilterLabel = "Laitteet:";
SupportedDevicesFilterTitle = "Tuettu";

ConnectionFilterLabel = "Yhteys:";

DeviceNameColumnTitle = "Laitteen nimi";
ConnectionColumnTitle = "Yhteys";
DetailsColumnTitle = "Laitemalli";
DeviceModelColumnTitle = "Tulostinmalli";

DeviceIsNotListedButtonTitle = "Laitetta ei ole luettelossa…";
SpecifyDeviceManuallyButtonTitle = "Määritä laite manuaalisesti…";

AdminPasswordIsSetOnDeviceTitle = "Valitulle laitteelle on määritetty järjestelmänvalvojan salasana";
AdminPasswordIsSetOnDeviceText = "Valittu laite vaikuttaa olevan jo määritetty. Jatka tästä huolimatta asennusta valitsemalla \"Jatka\"-painike.";
AdminPasswordIsSetOnDeviceAWCConnectionText = "Valittu laite vaikuttaa olevan jo määritetty.";

DeviceCommunicationError = "Tiedonsiirtovirhe";
DeviceCommunicationErrorText = "Laitteeseen yhteyttä muodostettaessa tapahtui virhe. Varmista, että laite on valmis, ja yritä uudelleen.";
DeviceCommunicationTimeoutErrorText = "Laite ei vastaa. Varmista, että laitteeseen on muodostettu yhteys ja yritä uudelleen.";

ManualSpecifyTaskDescription = "Määritä laite manuaalisesti";
ManualSpecifyOkButtonTitle = "Yhdistä";
